wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/create-transaction-3dsecure-error.json

{
    "type": "transaction",
    "id": "61df177c-76b3-4f0c-80fb-d1ad53764c91",
    "reconciliation_id": "2ygCx7feN98uAcJc6rv237",
    "merchant_account_id": "default",
    "created_at": "2024-08-06T18:26:27.762364+00:00",
    "updated_at": "2024-08-06T18:26:59.664571+00:00",
    "amount": 1000,
    "authorized_amount": 0,
    "captured_amount": 0,
    "refunded_amount": 0,
    "currency": "USD",
    "country": "US",
    "external_identifier": "166.3",
    "status": "authorization_declined",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "method": "card",
        "mode": "card",
        "label": "1111",
        "scheme": "visa",
        "expiration_date": "03\/30",
        "approval_url": "https:\/\/embed.sandbox.wikimedia.gr4vy.app\/start-method.html?authUrl=https%3A%2F%2Fapi.sandbox.wikimedia.gr4vy.app%2Fthree-d-secure-auth%3Fsignature%3DgAAAAABmsmrUCA6EDVWV1TFnLX4g2tZvaZl7TzVOnxKX78LW6RmCgtriqQmUKtfnSXvm_NcWoGVplc8-D4MyylBT-iIBty-j_tgOSsI-rMawfffR1hO554ZUAUtJNxDNhn9eMXmmpAySlnLemAaVN109JoqUVOBEHkZ2xZmXzzxiMzdVZfrj5sA20xck1hyMLN7BuJXi4ntxemuEkfI1eFK1lBROqx89mPS2G72J_tHw3v1601ZWZMd0ta5GQ9tdvLjB7shSmarHb7Jw3ugj21lLpEy0oW9phTxFqN94_0bmZx9ajDQFXVQrlD1sU_OTo0HVTYapiKn4U5kvxnaME1fqpalbWINC3ML94nohPRvP1UHW7MZePmhojb7doTVG6ZzEd3hSv9rER5SIuM1CwaoUsw9WoEo_aVi3fcfdlGh-oPwRcnSv4Pf-YeFnB3d2O_VDjobtPbcmpdQ0j52Zk1p3rkLjaW_s1g%3D%3D&redirectUrl=https%3A%2F%2Flocalhost%3A9001%2Findex.php%3Ftitle%3DSpecial%3AGravyGatewayResult%26order_id%3D166.3%26wmf_token%3D62a785d23eab33f3958344ec8b8fa75b%252B%255C%26amount%3D10.00%26currency%3DUSD%26payment_method%3Dcc%26payment_submethod%3D%26utm_source%3D..rcc%26recurring%3D1&formData=bnVsbA%3D%3D",
        "country": null,
        "currency": null,
        "details": {
            "bin": "444433",
            "card_type": null
        },
        "last_replaced_at": null,
        "fingerprint": "a54dbf79e952c3605bbcc5da520006c6d8d15722eef1296f79fe720583af238c",
        "id": null,
        "approval_target": null,
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "card",
    "instrument_type": null,
    "error_code": null,
    "payment_service": {
        "id": "9996be63-1e6f-4290-9d6e-b70f5d9b6bf8",
        "type": "payment-service",
        "payment_service_definition_id": "adyen-card",
        "method": "card",
        "display_name": "Adyen"
    },
    "pending_review": false,
    "buyer": {
        "id": "852a3568-62fb-4f8b-a7c5-cbb659f578aa",
        "type": "buyer",
        "display_name": "Jimmy Wales",
        "external_identifier": "jwales@example.com",
        "billing_details": {
            "first_name": "Jimmy",
            "last_name": "Wales",
            "email_address": "jwales@example.com",
            "phone_number": null,
            "address": {
                "city": "San Francisco",
                "country": "US",
                "postal_code": "94104",
                "state": "CA",
                "state_code": null,
                "house_number_or_name": null,
                "line1": "1 Montgomery Street",
                "line2": null,
                "organization": null
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "payment_source": "recurring",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": null,
    "three_d_secure": {
        "version": "2.1.0",
        "status": "error",
        "method": null,
        "response_data": null,
        "error_data": {
            "code": "305",
            "description": "No valid test input found",
            "detail": "Unknown test, see valid tests here https:\/\/docs.3dsecure.io\/3dsv2\/sandbox.html",
            "component": "D"
        }
    },
    "payment_service_transaction_id": null,
    "metadata": null,
    "authorized_at": null,
    "captured_at": null,
    "voided_at": null,
    "approval_expires_at": "2024-08-06T18:56:27.796841+00:00",
    "buyer_approval_timedout_at": null,
    "intent_outcome": "failed",
    "multi_tender": false
}